Countdown = 0  # 役職確認画面待機秒数

# メッセージリスト
codes = {
    "S100": "情報不足",
    "S200": "成功",
    "S201": "切断に成功",
    "S400": "エラー",
}

messages = {
    "M000": "メッセージなし",
    "M001": "プレイヤー名を入力してください",
    "M002": "プレイヤー名、ルームコードの両方を入力してください",
    "M004": "ルームコードが誤っています",
    "M005": "役職の数とプレイ人数を統一してください",
    "M011": "プレイヤー名が重複しています",
    "M101": "開始までお待ちください",
    "M102": "占い先を指定してください",
    "M103": "怪盗先を指定してください",
}


# 役職一覧
roles_dict = {
    "20": "村人",
    "21": "人狼",
    "22": "占い師",
    "23": "怪盗",
    "877": "バナナ",  # バナナ
}

#
ALLOWED_COMMANDS = {
    "ROOM": "S210",
    "ROOM_DISCUSSION_TIME": "S211",
    "ROOM_ROLE": "S212",
}
